Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/social_welfare/social_welfare_payments/disability_and_illness/invalidity_pension.html.txt.tmx
Source language: en
Languages: ga

source: Invalidity Pension is a weekly payment to people who cannot work because of a long-term illness or disability and are covered by social insurance (PRSI)
ga: Is íocaíocht sheachtainiúil í Pinsean Easláinte do dhaoine nach bhfuil i riocht oibre mar gheall ar bhreoiteacht fhadtéarmach nó mhíchumas agus atá clúdaithe ag árachas sóisialta (ÁSPC)

source: At 66, you transfer automatically to the State Pension (Contributory) at the full rate
ga: Nuair beidh tú 66 bliana d'aois aistrífear é go Pinsean Stáit (Rannaíocach) ag an ráta iomlán

source: Invalidity Pension is taxable
ga: Tá Pinsean Easláinte inchánach

source: You are entitled to a Free Travel Pass
ga: Tá tú i dteideal Pas Saorthaistil a bheith agat má tá Pinsean Easláinte á fháil agat

source: You may also get extra social welfare benefits, for example, the Household Benefits Package
ga: D’fheadfá a bheith i dteideal an Pacáiste Sochair Teaghlaigh a bheith agat freisin

source: To get Invalidity Pension you must have at least:
ga: Caithfear na nithe seo a leanas a bheith agat ar a laghad chun Pinsean Easláinte a fháil:

source: • 260 (5 years) paid PRSI contributions since entering social insurance
ga: • 260 (5 bliana) ranníocaíocht íoctha (stampa) ó thosaigh tú ag íoc árachais shóisialta

source: • 48 contributions paid or credited in the last complete tax year before the date of your claim
ga: • 48 ranníocaíocht íoctha (stampa) nó creidmheas tugtha ina n-aghaidh sa bhliain cánach iomlán is déanaí roimh dháta an éilimh

source: Note that only PRSI paid in classes A, E and H count
ga: Ní áirítear ach aicmí ÁSPC A, E agus H

source: The last complete tax year is the year before your claim
ga: An bhliain cánach is déanaí is ea an bhliain roimh an éilimh

source: For example, if you claim Invalidity Pension in 2017, the last complete tax year is 2016
ga: Mar shampla, má dhéantar éileamh ar Phinsean Easláinte in 2017, an bhliain cánach iomlán is déanaí ná 2016

source: Invalidity Pension is a payment for insured people who are permanently incapable of work because of an illness or incapacity
ga: Íocaíocht is ea an Pinsean Easláine do dhaoine árachaithe atá buan-éagumasach chun oibre de dheasca breoiteachta nó de dheasca éagumais

source: To qualify you must:
ga: Le cáiliú caithfidh tú a bheith:

source: • Have been incapable of work for at least 12 months and be likely to be incapable of work for at least another 12 months (you will probably have been getting Illness Benefit or Disability Allowance during that time)
ga: • Neamhábalta do chúrsaí fostaíochta ar feadh 12 mhí ar a laghad agus gur dócha go mbeidh tú neamhábalta do chúrsaí fostaíochta ar feadh 12 mhí eile ar a laghad (is dócha go mbeidh Sochar Breoiteachta nó Liúntas Míchumais á fháil agat ar feadh an ama)

source: • Be permanently incapable of work (in certain cases of very serious illness or disability, you can transfer directly from another social welfare payment or from your job to Invalidity Pension)
ga: • Neamhábalta do chúrsaí fostaíochta go buan (i gcásanna áirithe de bhreoiteacht nó míchumas atá fíor-thromchúiseach, féadfaidh tú aistriú go díreach ó íocaíocht leasa shóisialaigh eile nó ón bpost atá agat chuig Pinsean Easláinte)

source: A deciding officer of the Department of Social Protection will examine your claim and determine your entitlement based on the qualifying conditions outlined above
ga: Déanfaidh oifigeach breithiúnachta na Roinne Coimirce Sóisialaí scrúdú ar d’éileamh agus deimhneoidh sé/sí do theidlíocht bunaithe ar na coinníollacha cáilitheacha a dtugtar cuntas orthu thuas

source: Invalidity Pension and work
ga: Pinsean Easláinte agus obair

source: Since 13 February 2012, Partial Capacity Benefit has replaced the previous exemption arrangements where people on Invalidity Pension could get permission to work part-time (known as an exemption) for rehabilitative or therapeutic purposes and keep their full social welfare payment. There is no requirement that the work a person does while on Partial Capacity Benefit has to be for rehabilitative or therapeutic purposes. Training and employment schemes
ga: Ón 13 Feabhra 2012, cuirtear an Sochar Cumais Pháirtigh in ionad na socruithe díolúine a bhí ann roimhe seo, sa chás go bhféadfadh daoine ag a raibh Sochar Breoiteachta nó Pinsean Easláinte á fháil cead a fháil chun oibrithe go páirtaimseartha (ar a dtugtar díolúine) ar mhaithe le cuspóirí athshlánaithe nó teiripeacha agus a n-íocaíocht iomlán leasa shóisialaigh a choimeád

source: If you are on Illness Benefit or Invalidity Pension and want to do a training course, you do not go onto Partial Capacity Benefit. You apply to the Illness Benefit or Invalidity Pension section, as appropriate
ga: Ní gá go mbeidh an obair a dhéanann duine fad a bhíonn an Sochar Cumais Pháirtigh á fháil acu ar mhaithe le cuspóirí athshlánaithe nó teiripeacha

source: If you want to do a Community Employment scheme you apply in the normal way
ga: Is ar bhonn deonach atá an rannpháirtíocht ar scéim an tSochair Cumais Pháirtigh

source: ┌────────────────────────────┬──────────────────────────┐ │Invalidity Pension │Weekly rate, € │
ga: Má fhaigheann tú Sochar Breoiteachta nó Pinsean Easláinte agus más mian leat cúrsa oiliúna a dhéanamh, ní chuireann tú ar Shochar Cumais Pháirtigh

source: *Qualified adults who were over 66 before 2 January 2014 can continue to get a higher rate
ga: Más mian leat páirt i scéim Fostaíochta Pobail a ghlacadh, déanann tú iarratas ar an ngnáthbhealach

source: Rate of Invalidity Pension from 16 March 2017
ga: Rataí ó 16 Márta 2017

source: │Invalidity Pension │Weekly rate, € │
ga: │Ráta pearsanta │Ráta seachtainiúil, € │

source: │Aged under 66 │198.50 │
ga: │Aois faoi 66 │198.50 │

source: │Qualified adults* │141.70 │
ga: │Duine Fásta Cáilithe │141.70 │

source: │Qualified child │ │
ga: │Leanbh Cáilithe │ │

source: You may get an increase in your payment for an adult dependant and any child dependants you may have. You cannot claim an Increase for a Qualified Child (IQC) with your Invalidity Pension if your spouse, civil partner or cohabitant has an income of over €400 a week
ga: Ní féidir leat Méadú i leith Leanbh Cáilithe (IQC) a éileamh a thuilleadh le do Phinsean Easláinte má tá ioncam de bhreis ar €400 á thuilleamh ag do chéile, páirtnéir sibhialta nó do chomháititheoir sa tseachtain

source: You get a half-rate IQC if your spouse, civil partner or cohabitant earns between €310 and €400 a week
ga: Íoctar IQC leathráta leat má thuilleann do chéile, páirtnéir sibhialta nó do chomháititheoir idir €310 agus €400 sa tseachtain

source: This only applies to new claims after 5 July 2012
ga: Ní bhíonn seo i gceist ach amháin le héilimh nua i ndiaidh an 5 Iúil 2012

source: Invalidity Pension is a taxable source of income and should be reported to your tax office as soon as your payment starts
ga: Foinse ioncaim inchánaithe atá anseo agus ba cheart a chur in iúl don oifig chánach chomh luath agus a thosaíonn tú ag fáil na n-íocaíochtaí

source: You can contact the Revenue Commissioners for more information
ga: Is féidir teagmháil a dhéanamh le ÍMAT ar teileafón anseo

source: To apply fill in an Invalidity Pension application form (INV1) (pdf)
ga: Déan foirm iarratais don Phinsean Easláinte (pdf) a chomhlánú chun iarratas a dhéanamh

source: You can also get a form from your Intreo Centre or Social Welfare Branch Office
ga: Is féidir leat foirm a fháil ón Oifig Leasa Shóisialaigh Áitiúil

source: If you have been getting Illness Benefit for a period of 468 days you will be medically assessed for continued entitlement to Illness Benefit and possible entitlement to Invalidity Pension
ga: Má bhí Sochar Breoiteachta á fháil agat ar feadh tréimhse 468 lá, déanfar measúnú leighis ort lena dheimhniú an bhfuil tú i dteideal Sochar Breoiteachta a fháil ar bhonn leanúnach agus lena dheimhniú an mbeifeá i dteideal Pinsean Easláinte a fháil

source: If as a result of this assessment it is considered that you may be entitled to Invalidity Pension, an application form (INV2) will be sent to you
ga: Má mheastar, mar thoradh ar an measúnú seo, go bhféadfá bheith i dteideal Pinsean Easláinte a fháil, seolfar foirm iarratais (INV2) chugat

source: When they get the completed form a Deciding Officer will examine the claim and determine eligibility for Invalidity Pension
ga: Nuair a fhaigheann siad an fhoirm chomhlánaithe, scrúdóidh oifigeach breithiúnachta an t-éileamh agus deimhneoidh siad incháilitheacht do Phinsean Easláinte

source: This does not stop you from applying for Invalidity Pension in the normal way using application form (INV1)
ga: Ní chuireann seo cosc ort ó iarratas a dhéanamh ar Phinsean Easláinte ar an ngnáthbhealach trí fhoirm iarratais (INV1) a úsáid

source: You can get help to fill in your form from your local Citizens Information Centre, Intreo Centre or Social Welfare Branch Office
ga: Is féidir leat cúnamh a fháil chun an fhoirm a chomhlánú san Ionad Faisnéise do Shaoránaigh áitiúil nó san Oifig Leasa Shóisialaigh Áitiúil

source: If you think you have been wrongly refused Invalidity Pension or you are unhappy about a decision of a Deciding Officer, you can appeal this decision
ga: Má mheasann tú nár cheart gur diúltaíodh Pinsean Easláinte duit, nó mura bhfuil tú sásta le cinneadh a rinne Oifigeach Cinnidh Leasa Shóisialaigh faoi do theidlíochtaí tá sé de rogha agat achomharc a dhéanamh in aghaidh an chinnidh seo
